jmeter/scenarios/seckill-pure-jmeter.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Dianping Seckill - 500 Users (Pure JMeter)">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"/>
    </TestPlan>
    <hashTree>
      <!-- setUp: 批量生成用户 token -->
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="setUp-生成用户Token">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">1</intProp>
        </elementProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="JSR223-生成用户Token">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
String cmd = "bash jmeter/scenarios/gen-test-users.sh ${target.host} ${target.port} ${user.count} ${csv.file}"
ProcessBuilder pb = new ProcessBuilder("bash", "-c", cmd)
pb.directory(new File("${project.dir}"))
pb.redirectErrorStream(true)
Process p = pb.start()
String output = new BufferedReader(new InputStreamReader(p.getInputStream())).text
int ec = p.waitFor()
log.info("gen-users output: " + output.trim())
if (ec == 0 &amp;&amp; output.contains("DONE")) {
    SampleResult.setSuccessful(true)
    SampleResult.setResponseMessage("OK")
} else {
    SampleResult.setSuccessful(false)
    SampleResult.setResponseMessage("FAIL: " + output.trim())
}
</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>

      <!-- 参数定义 -->
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="参数">
        <collectionProp name="Arguments.arguments">
          <elementProp name="target.host" elementType="Argument">
            <stringProp name="Argument.name">target.host</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="target.port" elementType="Argument">
            <stringProp name="Argument.name">target.port</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
          </elementProp>
          <elementProp name="user.count" elementType="Argument">
            <stringProp name="Argument.name">user.count</stringProp>
            <stringProp name="Argument.value">500</stringProp>
          </elementProp>
          <elementProp name="csv.file" elementType="Argument">
            <stringProp name="Argument.name">csv.file</stringProp>
            <stringProp name="Argument.value">/tmp/seckill-users-jmeter.csv</stringProp>
          </elementProp>
          <elementProp name="project.dir" elementType="Argument">
            <stringProp name="Argument.name">project.dir</stringProp>
            <stringProp name="Argument.value">/home/zlwu/agent_code/dianping</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>

      <!-- 主测试：500 用户秒杀 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="500用户-秒杀">
        <intProp name="ThreadGroup.num_threads">500</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">1</intProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="用户Token CSV">
          <stringProp name="filename">/tmp/seckill-users-jmeter.csv</stringProp>
          <stringProp name="variableNames">phone,token</stringProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">false</boolProp>
          <boolProp name="stopThread">true</boolProp>
          <stringProp name="shareMode">thread</stringProp>
        </CSVDataSet>
        <hashTree/>

        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Headers">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">${token}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="秒杀下单">
          <stringProp name="HTTPSampler.domain">${target.host}</stringProp>
          <intProp name="HTTPSampler.port">8080</intProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/voucher/seckill/1</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>